In [94]:
#Importing and Reading Data
import pandas
train_data = "https://www.kaggle.com/c/titanic/download/train.csv"
test_data = "https://www.kaggle.com/c/titanic/download/test.csv"
ds = pandas.read_csv('train.csv')
ds.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [95]:
#Data Cleaning
ds = ds.drop(['Name','Ticket','PassengerId'],1)
ds.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [96]:
Missing_Ages = sum(ds['Age'].isnull()) 
Missing_Cabin = sum(ds['Cabin'].isnull())
#features.shape()
print "Total Entries", len(ds.index)
print "Missing ages information", Missing_Ages
print "Missing cabin information", Missing_Cabin

Total Entries 891
Missing ages information 177
Missing cabin information 687

In [97]:
#dropping Cabin because most entries for cabin value are missing
ds = ds.drop('Cabin',1)
ds.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [107]:
#Dropping all rows with any NA value with dropna
features = ds.dropna()
print "Total number of rows left",len(ds.index)
ds.head()

Total number of rows left 891

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [102]:
ds.shape

(891, 8)

In [108]:
lables = ds['Survived']
features = ds.drop('Survived',1)
features.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [109]:
#Separating Cross Validation Set
from sklearn.model_selection import train_test_split

features_train, features_test, labels_train, y_test = train_test_split(features, labels, test_size=0.4, random_state=0)
features_train.head()

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
100       3  female  28.0      0      0    7.8958        S
722       2    male  34.0      0      0   13.0000        S
678       3  female  43.0      1      6   46.9000        S
229       3  female   NaN      3      1   25.4667        S
334       1  female   NaN      1      0  133.6500        S